Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver
The Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver class resolves the tolerated
segment geometry out of the given toleration data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver.resolve
The delegate to call when the Resolve method gets executed.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver.viewData
The view data associated with the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver.#ctor(System.Func{Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo,System.Nullable{Tekla.Common.Geometry.Segment3}},Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver class.
resolve: The delegate to call when the Resolve method gets executed.
viewData: The view data associated with the tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.ToleratedSegmentResolver.Resolve(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine)
Resolves the segment geometry out of the toleration data.
tolerationData: The toleration data to be used for resolving the geometry.
Returns: Resolved segment geometry.